In [1]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_excel('PD 2022 WK 3 Grades.xlsx')

In [3]:
df_pivot = pd.melt(data, id_vars=['Student ID'],var_name='Subject', value_name='Score')

In [4]:
df_pivot.head()

   Student ID Subject  Score
0           1   Maths     66
1           2   Maths     84
2           3   Maths     88
3           4   Maths     65
4           5   Maths     86

In [5]:
label = ['F', 'E', 'D', 'C', 'B', 'A']
df_pivot['Grade'] = df_pivot.groupby('Subject')['Score'].rank(method='first').transform(lambda x: pd.qcut(x, q=6, labels=label))

In [6]:
points = {'A' : 10, 'B' : 8,'C' : 6, 'D' : 4, 'E' : 2, 'F' : 1}
df_pivot['Points'] = df_pivot['Grade'].map(points)
df_pivot['Points']=df_pivot['Points'].astype('int64')

In [7]:
df_pivot['Total_points_per_student']=df_pivot.groupby('Student ID')['Points'].transform('sum')

In [8]:
df_pivot['Avg student total points per grade'] = df_pivot.groupby('Grade')['Total_points_per_student']\
                                                                            .transform('mean').round(2)

In [9]:
atleast_a = df_pivot[df_pivot['Grade']=='A']['Avg student total points per grade'].min()
df_pivot = df_pivot.loc[df_pivot['Total_points_per_student'] >= atleast_a]

In [10]:
df_pivot = df_pivot[df_pivot['Grade'] != 'A']

In [11]:
df_pivot[(df_pivot['Subject']=='English')&(df_pivot['Student ID']>300)]

,Student ID,Subject,Score,Grade,Points,Total_points_per_student,Avg student total points per grade
1313,314,English,89,B,8,45,38.91
1317,318,English,80,D,4,42,35.02
1324,325,English,64,F,1,43,31.68
1325,326,English,63,F,1,47,31.68
1327,328,English,77,D,4,42,35.02
...,...,...,...,...,...,...,...
1980,981,English,75,D,4,46,35.02
1987,988,English,87,B,8,46,38.91
1992,993,English,61,F,1,42,31.68
1993,994,English,82,C,6,42,36.84
1995,996,English,85,C,6,49,36.84

##### End of Code